let handler = async (m, { conn, text, participants, groupMetadata }) => {
  let users = participants
    .map(u => u.id)
    .filter(v => v !== conn.user.jid)

  let title = "𝐖𝗂𐓣𝗍𝖾𝗋 𝐒𐓣ⱺω 𝐓α𝗀"
  let gname = `𝐆𝗋ⱺυρ: ${groupMetadata.subject}`
  let msg = text ? `𝐌𝖾𝗌𝗌α𝗀𝖾: ${text}` : ""
  let count = `𝐌𝖾ꭑᑲ𝖾𝗋𝗌: ${participants.length}`

  let anime = `
╔━━━━━━━✧𐙚 ❄️ 𐙚✧━━━━━━━╗
         𝐖𝗂𐓣𝗍𝖾𝗋 𝚰𝗌 𝐂ⱺꭑ𝗂𐓣𝗀☃️ 
     𝐂ⱺᥣᑯ ᑯα𝗒𝗌 𝐂ⱺᥣᑯ𝖾𝗋 𝐌𝖾ꭑⱺ𝗋𝗂𝖾𝗌
╚━━━━━━━✧𐙚 ❄️ 𐙚✧━━━━━━━╝


▌ ❄️ *${title}* ✨
▌ ❄️ ${gname}
▌ ❄️ ${count}
▌ ❄️ ${text ? `┃ 🌸 ${msg}` : ""}


🌬️ *𝑺𝒏𝒐𝒘𝒇𝒍𝒂𝒌𝒆 𝑴𝒆𝒏𝒕𝒊𝒐𝒏𝒔* 🌬️
──────────────────────────
${users.map(v => "━ ✦ ⃞🧊°° @" + v.replace(/@.+/, "")).join("\n")}

✦────────────────────────✦
✨ “𝐒𐓣ⱺω𝖿ᥣα𝗄𝖾𝗌 𝖿αᥣᥣ… ᑲυ𝗍 ω𝖾 𝗋𝗂𝗌𝖾.” ✨
✦────────────────────────✦
  `.trim()

  m.reply(anime, null, { mentions: users })
}

handler.help = ['tagall']
handler.tags = ['group']
handler.command = ['tagall']
handler.admin = false
handler.group = true
handler.desc = "Anime-style fancy TagAll"

export default handler
